{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "description": "We are seeking a talented Front-End Developer to join our team in Boston, MA. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with modern JavaScript frameworks such as React or Angular.",
      "location": "Amman, jordan",
      "salary": "$70K - $80K",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "2",
      "title": "Front-End Engineer (React & Redux)",
      "type": "Full-Time",
      "location": "Amman, jordan",
      "description": "Join our team as a Front-End Developer in sunny Miami, FL. We are looking for a motivated individual with a passion for crafting beautiful and responsive web applications. Experience with UI/UX design principles and a strong attention to detail are highly desirable.",
      "salary": "$70K - $80K",
      "company": {
        "name": "Veneer Solutions",
        "description": "Veneer Solutions is a creative agency specializing in digital design and development. Our team is dedicated to pushing the boundaries of creativity and innovation to deliver exceptional results for our clients.",
        "contactEmail": "contact@loremipsum.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "3",
      "title": "React.js Dev",
      "type": "Full-Time",
      "location": "Amman, jordan",
      "description": "Are you passionate about front-end development? Join our team in vibrant Brooklyn, NY, and work on exciting projects that make a difference. We offer competitive compensation and a collaborative work environment where your ideas are valued.",
      "salary": "$70K - $80K",
      "company": {
        "name": "Dolor Cloud",
        "description": "Dolor Cloud is a leading technology company specializing in digital solutions for businesses of all sizes. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "contact@dolorsitamet.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "4",
      "title": "React Front-End Developer",
      "type": "Part-Time",
      "description": "Join our team as a Part-Time Front-End Developer in beautiful Pheonix, AZ. We are looking for a self-motivated individual with a passion for creating engaging user experiences. This position offers flexible hours and the opportunity to work remotely.",
      "location": "Zarqa, Jordan",
      "salary": "$60K - $70K",
      "company": {
        "name": "Alpha Elite",
        "description": "Alpha Elite is a dynamic startup specializing in digital marketing and web development. We are committed to fostering a diverse and inclusive workplace where creativity and innovation thrive.",
        "contactEmail": "contact@adipisicingelit.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "5",
      "title": "Full-Stack JavaScript Developer",
      "type": "Full-Time",
      "description": "We are looking for a Full-Stack Developer skilled in JavaScript frameworks to join our team in Seattle, WA. The ideal candidate has experience with both front-end (React, Angular) and back-end (Node.js) technologies.",
      "location": "Irbid, Jordan",
      "salary": "$80K - $90K",
      "company": {
        "name": "TechNest",
        "description": "TechNest is a pioneer in technology solutions, providing cutting-edge applications for various industries. Our team values collaboration, innovation, and excellence in delivering top-tier solutions to clients.",
        "contactEmail": "contact@technest.com",
        "contactPhone": "555-555-5556"
      }
    },
    {
      "id": "6",
      "title": "Junior Front-End Developer",
      "type": "Part-Time",
      "description": "A growing team in Austin, TX, is searching for an entry-level Front-End Developer to work on responsive web applications. Candidates with a foundation in HTML, CSS, and JavaScript are encouraged to apply.",
      "location": "Mafraq, Jordan",
      "salary": "$50K - $60K",
      "company": {
        "name": "BrightCode",
        "description": "BrightCode is an innovative web development agency focused on delivering high-quality, user-friendly digital experiences. Our team encourages growth, learning, and teamwork.",
        "contactEmail": "contact@brightcode.com",
        "contactPhone": "555-555-5557"
      }
    },
    {
      "id": "7",
      "title": "React Native Developer",
      "type": "Full-Time",
      "description": "We are seeking a React Native Developer to join our remote team. The candidate will be responsible for developing and maintaining high-performance mobile applications for both iOS and Android.",
      "location": "Ajloun, Jordan",
      "salary": "$75K - $85K",
      "company": {
        "name": "AppVentures",
        "description": "AppVentures is dedicated to creating powerful mobile applications that enhance user engagement. We strive to offer a dynamic and supportive environment for our developers.",
        "contactEmail": "contact@appventures.com",
        "contactPhone": "555-555-5558"
      }
    },
    {
      "id": "8",
      "title": "React Front-End Developer",
      "type": "Contract",
      "description": "Join our team in San Diego, CA, as a Contract Front-End Developer with React expertise. This is a project-based position with flexible hours and the opportunity to work remotely.",
      "location": "Madaba, Jordan",
      "salary": "$65K - $75K",
      "company": {
        "name": "WebWave",
        "description": "WebWave is a contract-based digital solutions provider, working with top clients in various industries to deliver high-quality, customized web experiences.",
        "contactEmail": "contact@webwave.com",
        "contactPhone": "555-555-5559"
      }
    },
    {
      "id": "9",
      "title": "Senior UI/UX Designer",
      "type": "Full-Time",
      "description": "Seeking a creative and experienced UI/UX Designer in San Francisco, CA, to work on user-centered designs for our web and mobile applications. Ideal candidates have a strong portfolio and experience with Figma and Adobe XD.",
      "location": "Aqaba, Jordan",
      "salary": "$85K - $95K",
      "company": {
        "name": "DesignHub",
        "description": "DesignHub specializes in crafting engaging user experiences for digital products. Our team emphasizes creativity, innovation, and user-first design.",
        "contactEmail": "contact@designhub.com",
        "contactPhone": "555-555-5560"
      }
    },
    {
      "id": "10",
      "title": "Backend Developer (Node.js)",
      "type": "Full-Time",
      "description": "We are hiring a Backend Developer with strong Node.js experience to join our team in Denver, CO. The role involves building scalable APIs and working closely with the front-end team to deliver seamless applications.",
      "location": "Salt, Jordan",
      "salary": "$90K - $100K",
      "company": {
        "name": "BackEndPros",
        "description": "BackEndPros focuses on robust backend solutions for complex web applications, aiming to support businesses in achieving fast, reliable digital products.",
        "contactEmail": "contact@backendpros.com",
        "contactPhone": "555-555-5561"
      }
    },
    {
      "id": "11",
      "title": "React Developer",
      "type": "Freelance",
      "description": "Join our freelance network as a React Developer working remotely. This role involves project-based work focusing on creating dynamic and responsive front-end applications.",
      "location": "Irbid, Jordan",
      "salary": "$30K - $40K per project",
      "company": {
        "name": "FreelanceGigs",
        "description": "FreelanceGigs connects talented developers with top-tier freelance opportunities worldwide, providing support and resources for freelancers.",
        "contactEmail": "contact@freelancegigs.com",
        "contactPhone": "555-555-5562"
      }
    },
    {
      "id": "12",
      "title": "Mid-Level Angular Developer",
      "type": "Full-Time",
      "description": "Seeking an Angular Developer with experience in TypeScript to join our fast-growing team in Los Angeles, CA. The ideal candidate is passionate about front-end technologies and has a strong grasp of UI/UX principles.",
      "location": "Karak, Jordan",
      "salary": "$70K - $80K",
      "company": {
        "name": "AngleSoft",
        "description": "AngleSoft delivers high-quality web applications, with a strong focus on front-end frameworks like Angular."
      }
    }
  ]
}
